# Taps
tap "bellecp/fast-p"
tap "crisidev/chunkwm"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "koekeishiya/formulae"
tap "minio/stable"
tap "osx-cross/avr"

# Packages
brew "ansible"
brew "coreutils"
brew "exa"
brew "fasd"
brew "fast-pdf-finder"
brew "figlet"
brew "findutils"
brew "fontconfig"
brew "freetype"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gettext"
brew "grep"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lua"
brew "mc"
brew "moreutils"
brew "mosh"
brew "openssl"
brew "rename"
brew "skhd"
brew "teleport"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "yaiba"
brew "youtube-dl"